{
    "Ola, Bom dia!!": "Bom dia para voce tambem, como que eu posso ajudar?",
    "Qual a diferença entre CSS e HTML?": "HTML é usado para estruturar o conteúdo, enquanto o CSS é usado para estilizar esse conteúdo.",
    "O que são as tags HTML?": "Tags HTML são os elementos utilizados para estruturar e organizar o conteúdo em uma página web.",
    "O que é um 'box model' em CSS?": "O box model define o comportamento de uma caixa que envolve cada elemento de uma página web, incluindo margem, borda, preenchimento e conteúdo.",
    "O que são pseudoclasses em CSS?": "Pseudoclasses são usadas para definir o estilo de um elemento em um estado específico, como :hover para quando o mouse passa sobre um elemento.",
    "O que é o Flexbox?": "Flexbox é um layout model em CSS que permite criar layouts flexíveis e responsivos com facilidade.",
    "O que é o Grid Layout em CSS?": "Grid Layout é um sistema de layout baseado em uma grade bidimensional, permitindo criar layouts complexos com facilidade.",
    "O que é o JavaScript?": "JavaScript é uma linguagem de programação usada para adicionar interatividade às páginas web.",
    "Qual a diferença entre var, let e const em JavaScript?": "var tem escopo global ou de função, let tem escopo de bloco e const é usado para declarar variáveis imutáveis.",
    "O que é o DOM?": "O DOM (Document Object Model) é uma representação da estrutura da página web que permite a manipulação dinâmica do conteúdo.",
    "O que é o conceito de 'event bubbling' em JavaScript?": "Event bubbling é um conceito onde os eventos são propagados de um elemento alvo até o elemento raiz.",
    "O que é um 'callback' em JavaScript?": "Callback é uma função passada como argumento para outra função, que é executada em algum momento no futuro.",
    "Qual a diferença entre 'null' e 'undefined' em JavaScript?": "'null' é um valor atribuído a uma variável que indica a ausência de valor, enquanto 'undefined' significa que a variável foi declarada, mas ainda não foi atribuída a nenhum valor.",
    "O que são 'Promises' em JavaScript?": "Promises são objetos usados para representar o resultado de operações assíncronas em JavaScript.",
    "O que é AJAX?": "AJAX (Asynchronous JavaScript and XML) é uma técnica para enviar e receber dados do servidor de forma assíncrona sem precisar recarregar a página.",
    "O que são frameworks em JavaScript?": "Frameworks são conjuntos de bibliotecas e ferramentas que ajudam a desenvolver aplicações web de maneira mais rápida e estruturada.",
    "O que é o React?": "React é uma biblioteca JavaScript para construir interfaces de usuário dinâmicas e reutilizáveis.",
    "O que é o Vue.js?": "Vue.js é um framework JavaScript progressivo usado para construir interfaces de usuário e aplicativos de página única.",
    "O que é o Angular?": "Angular é um framework JavaScript desenvolvido pelo Google para criar aplicativos web dinâmicos de página única.",
    "O que são componentes em React?": "Componentes em React são unidades reutilizáveis de código que controlam partes da interface de usuário.",
    "O que é print?": "Print é uma função que imprimi tudo o que esta dentro do parênteses, por exemplo: se você colocar print(\"Ola, mundo\"), a maquina sera digitar \"ola, mundo\".",
    "O que é CSS?": "(Cascading Style Sheets) é uma linguagem que serve para personalizar sites web, possui um mecanismo que muda formatos, muda cores e outros elementos, onde sua principal função é estilizar e personalizar.",
    "O que são seletores em CSS?": "Seletores em CSS são usados para selecionar os elementos HTML aos quais você quer aplicar estilos.",
    "O que é a propriedade 'color' em CSS?": "A propriedade 'color' é usada para definir a cor do texto de um elemento.",
    "O que é a propriedade 'background-color' em CSS?": "A propriedade 'background-color' é usada para definir a cor de fundo de um elemento.",
    "O que é o modelo de caixa (box model) em CSS?": "O box model define o comportamento de uma caixa que envolve cada elemento de uma página web, incluindo margem, borda, preenchimento e conteúdo.",
    "O que é o 'display' em CSS?": "A propriedade 'display' em CSS define como o elemento será exibido na página, como bloco, linha ou como um item flexível.",
    "Qual a diferença entre 'block' e 'inline' em CSS?": "'block' faz com que o elemento ocupe toda a largura disponível e inicie em uma nova linha, enquanto 'inline' faz com que o elemento ocupe apenas o espaço necessário e permaneça na mesma linha.",
    "O que é a propriedade 'position' em CSS?": "A propriedade 'position' define o método de posicionamento de um elemento, como 'static', 'relative', 'absolute', 'fixed' ou 'sticky'.",
    "O que são 'pseudoclasses' em CSS?": "Pseudoclasses são usadas para definir o estilo de um elemento em um estado específico, como :hover, :focus ou :nth-child.",
    "O que são 'pseudoelementos' em CSS?": "Pseudoelementos são usados para aplicar estilo a partes específicas de um elemento, como ::before e ::after.",
    "O que é 'flexbox' em CSS?": "Flexbox é um layout model em CSS que permite criar layouts flexíveis e responsivos com facilidade.",
    "O que é o 'grid layout' em CSS?": "Grid Layout é um sistema de layout baseado em uma grade bidimensional, permitindo criar layouts complexos com facilidade.",
    "O que é a propriedade 'width' em CSS?": "A propriedade 'width' define a largura de um elemento.",
    "O que é a propriedade 'height' em CSS?": "A propriedade 'height' define a altura de um elemento.",
    "O que é 'float' em CSS?": "A propriedade 'float' permite que um elemento seja posicionado à esquerda ou à direita dentro de seu contêiner, fazendo com que o conteúdo ao redor flua em torno dele.",
    "O que é 'clear' em CSS?": "A propriedade 'clear' é usada para controlar o comportamento de elementos flutuantes ao seu redor, podendo impedir o fluxo de elementos flutuantes.",
    "O que são unidades relativas em CSS?": "Unidades relativas em CSS, como %, em, rem, são baseadas no tamanho de outros elementos ou no tamanho da tela, tornando os layouts mais flexíveis.",
    "O que é a propriedade 'margin' em CSS?": "A propriedade 'margin' define o espaço entre o conteúdo de um elemento e as bordas externas dele.",
    "O que é a propriedade 'padding' em CSS?": "A propriedade 'padding' define o espaço entre o conteúdo de um elemento e suas bordas internas.",
    "O que são as transições em CSS?": "Transições em CSS permitem alterar suavemente as propriedades de um elemento quando há uma mudança de estado, como ao passar o mouse sobre um botão.",
    "O que é a propriedade 'border' em CSS?": "A propriedade 'border' define uma borda ao redor de um elemento, podendo ser personalizada com espessura, estilo e cor.",
    "O que é a propriedade 'box-shadow' em CSS?": "A propriedade 'box-shadow' aplica uma sombra a um elemento, podendo ser personalizada com cor, desfoque e posição.",
    "O que é a propriedade 'text-align' em CSS?": "A propriedade 'text-align' é usada para alinhar o texto dentro de um elemento, podendo ser à esquerda, à direita ou centralizado.",
    "O que é a propriedade 'font-size' em CSS?": "A propriedade 'font-size' define o tamanho da fonte do texto em um elemento.",
    "O que é a propriedade 'font-family' em CSS?": "A propriedade 'font-family' define o tipo de fonte a ser usada no texto de um elemento.",
    "O que são 'media queries' em CSS?": "Media queries são regras CSS que permitem aplicar estilos diferentes dependendo das características da tela, como largura ou resolução.",
    "O que é a propriedade 'opacity' em CSS?": "A propriedade 'opacity' define a transparência de um elemento, variando de 0 (totalmente transparente) a 1 (totalmente opaco).",
    "O que é o 'z-index' em CSS?": "O 'z-index' define a ordem de sobreposição de elementos empilhados, com valores maiores sendo exibidos na frente.",
    "O que são 'animacoes' em CSS?": "Animações em CSS permitem criar mudanças no estilo de um elemento de forma gradual ao longo do tempo, criando efeitos dinâmicos.",
    "O que é a propriedade 'text-transform' em CSS?": "A propriedade 'text-transform' é usada para transformar o texto, como deixando-o em maiúsculas, minúsculas ou capitalizado.",
    "O que é a propriedade 'visibility' em CSS?": "A propriedade 'visibility' controla a visibilidade de um elemento, podendo ser 'visible' ou 'hidden', mas ao contrário de 'display', o espaço do elemento é mantido.",
    "O que é a propriedade 'cursor' em CSS?": "A propriedade 'cursor' altera o tipo de cursor que aparece ao passar o mouse sobre um elemento, como 'pointer', 'default', 'move', etc.",
    "O que é a propriedade 'overflow' em CSS?": "A propriedade 'overflow' define como o conteúdo de um elemento será tratado quando exceder o tamanho de seu contêiner, podendo ser 'visible', 'hidden', 'scroll' ou 'auto'.",
    "O que é Python?": "Python é uma linguagem de programação de alto nível, conhecida por sua simplicidade e legibilidade. É amplamente usada em várias áreas, como desenvolvimento web, automação, análise de dados e aprendizado de máquina.",
    "O que é uma variável em Python?": "Uma variável em Python é um nome que é atribuído a um valor para que você possa referenciá-lo durante o programa. Você pode criar uma variável simplesmente atribuindo um valor a um nome.",
    "O que é uma lista em Python?": "Uma lista em Python é uma estrutura de dados que armazena uma coleção de itens em uma ordem específica. Ela pode conter elementos de diferentes tipos de dados e é mutável.",
    "O que é um dicionário em Python?": "Um dicionário em Python é uma coleção de pares chave-valor, onde você pode armazenar valores associados a uma chave única. É mutável e não mantém uma ordem específica.",
    "O que são tuplas em Python?": "Tuplas em Python são semelhantes às listas, mas são imutáveis. Uma vez criadas, não podem ser alteradas, tornando-as mais eficientes em certos contextos.",
    "Qual a diferença entre uma lista e uma tupla em Python?": "A principal diferença é que listas são mutáveis (podem ser alteradas após a criação), enquanto tuplas são imutáveis (não podem ser alteradas depois de criadas).",
    "O que é um loop em Python?": "Um loop em Python é uma estrutura de controle que permite repetir um bloco de código várias vezes. Existem dois tipos de loops: 'for' e 'while'.",
    "O que é um 'for loop' em Python?": "O 'for loop' é utilizado para iterar sobre uma sequência (como uma lista, tupla, ou string), executando um bloco de código para cada item da sequência.",
    "O que é um 'while loop' em Python?": "O 'while loop' executa um bloco de código enquanto uma condição for verdadeira. Se a condição nunca for falsa, o loop pode continuar infinitamente.",
    "O que são funções em Python?": "Funções em Python são blocos de código reutilizáveis que podem ser chamados para realizar uma tarefa específica. Elas são definidas usando a palavra-chave 'def'.",
    "O que são parâmetros e argumentos em Python?": "Parâmetros são as variáveis listadas dentro de parênteses em uma função, enquanto argumentos são os valores passados para esses parâmetros quando a função é chamada.",
    "O que é uma string em Python?": "Uma string em Python é uma sequência de caracteres. Você pode criar strings com aspas simples ou duplas, por exemplo, 'olá' ou \"olá\".",
    "O que são listas de compreensão (list comprehensions) em Python?": "List comprehensions em Python são uma maneira concisa de criar listas usando uma expressão compacta, facilitando a criação e filtragem de listas.",
    "O que é um 'if' em Python?": "'if' é uma estrutura condicional usada para executar um bloco de código se uma condição for verdadeira.",
    "O que é uma exceção em Python?": "Uma exceção em Python é um erro que ocorre durante a execução do programa. As exceções podem ser tratadas com 'try' e 'except' para evitar que o programa trave.",
    "O que é uma função lambda em Python?": "Uma função lambda é uma função anônima e pequena em Python, definida com a palavra-chave 'lambda'. Geralmente é usada para funções simples que podem ser passadas como argumento para outras funções.",
    "O que é o módulo 'math' em Python?": "O módulo 'math' em Python fornece funções matemáticas, como exponenciação, logaritmos e funções trigonométricas.",
    "O que é o comando 'import' em Python?": "O comando 'import' é utilizado para trazer módulos ou pacotes externos para o seu programa, permitindo o uso de funções e variáveis desses módulos.",
    "O que é um 'decorator' em Python?": "Um decorator em Python é uma função que modifica o comportamento de outra função. Ele é geralmente usado para adicionar funcionalidades a funções ou métodos de maneira reutilizável.",
    "O que é a programação orientada a objetos (POO) em Python?": "A programação orientada a objetos em Python é um paradigma que organiza o código em classes e objetos. Classes são modelos, e objetos são instâncias dessas classes.",
    "O que é uma classe em Python?": "Uma classe em Python é uma estrutura que define os atributos (dados) e métodos (funções) de objetos. É um modelo para criar objetos.",
    "O que é o método '__init__' em Python?": "O método '__init__' é um método especial em Python que é chamado automaticamente quando um objeto é criado. Ele é usado para inicializar os atributos do objeto.",
    "O que é HTML?":"HTML é a linguagem de marcação usada para estruturar o conteúdo das páginas web.",
    "O que são tags HTML?": "Tags HTML são os elementos utilizados para estruturar e organizar o conteúdo em uma página web.",
    "O que é a tag <html>?": "A tag <html> é o elemento raiz de um documento HTML, que envolve todo o conteúdo da página.",
    "O que é a tag <head>?": "A tag <head> contém informações sobre o documento, como título, links para estilos e metadados.",
    "O que é a tag <body>?": "A tag <body> contém o conteúdo principal da página web, como texto, imagens e outros elementos.",
    "O que é a tag <title>?": "A tag <title> define o título da página, que é exibido na aba do navegador.",
    "O que é a tag <h1>?": "A tag <h1> é usada para definir o cabeçalho principal de uma página, sendo o de maior importância.",
    "O que é a tag <h2>?": "A tag <h2> é usada para definir subtítulos ou cabeçalhos de segundo nível, abaixo do <h1>.",
    "O que são listas no HTML?": "Listas no HTML são usadas para agrupar itens de forma ordenada ou não ordenada, com as tags <ul>, <ol> e <li>.",
    "O que é a tag <a>?": "A tag <a> é usada para criar links para outras páginas ou recursos. O atributo 'href' define o destino.",
    "O que é a tag <img>?": "A tag <img> é usada para inserir imagens na página web, com o atributo 'src' para definir o caminho da imagem.",
    "O que é a tag <div>?": "A tag <div> é um contêiner genérico usado para agrupar outros elementos e aplicar estilos ou scripts.",
    "O que é a tag <span>?": "A tag <span> é um contêiner genérico para aplicar estilos em partes de texto ou outros elementos inline.",
    "O que é a tag <form>?": "A tag <form> é usada para criar formulários, permitindo que o usuário insira dados e envie para um servidor.",
    "O que são atributos HTML?": "Atributos HTML fornecem informações adicionais sobre um elemento, como 'href', 'src', 'alt', entre outros.",
    "O que é o atributo 'href' na tag <a>?": "O atributo 'href' define o destino de um link na tag <a>, indicando para onde o link irá redirecionar.",
    "O que é o atributo 'src' na tag <img>?": "O atributo 'src' define o caminho da imagem a ser exibida na tag <img>.",
    "O que é o atributo 'alt' na tag <img>?": "O atributo 'alt' fornece uma descrição alternativa para a imagem, importante para acessibilidade.",
    "O que são comentários em HTML?": "Comentários em HTML são usados para adicionar notas dentro do código sem que elas apareçam na página. São escritos com <!-- e -->.",
    "O que é a tag <link>?": "A tag <link> é usada para vincular recursos externos, como arquivos CSS, ao documento HTML.",
    "O que é a tag <meta>?": "A tag <meta> fornece metadados sobre a página, como informações sobre o conjunto de caracteres ou autor.",
    "O que é a tag <style>?": "A tag <style> é usada para incluir regras CSS diretamente dentro de um documento HTML.",
    "O que é a tag <script>?": "A tag <script> é usada para incluir ou referenciar código JavaScript em um documento HTML.",
    "O que é o atributo 'class' em HTML?": "O atributo 'class' é usado para aplicar um ou mais nomes de classe a um elemento, permitindo aplicar estilos ou manipular via JavaScript.",
    "O que é o atributo 'id' em HTML?": "O atributo 'id' é usado para identificar um elemento de forma única na página, permitindo manipulação via CSS ou JavaScript.",
    "O que é a tag <table>?": "A tag <table> é usada para criar tabelas em HTML, onde você pode organizar dados em linhas e colunas.",
    "O que é a tag <tr>?": "A tag <tr> é usada para definir uma linha dentro de uma tabela HTML.",
    "O que é a tag <td>?": "A tag <td> define uma célula dentro de uma linha em uma tabela HTML.",
    "O que é a tag <th>?": "A tag <th> define uma célula de cabeçalho dentro de uma tabela HTML, geralmente com texto em negrito e centralizado.",
    "O que é a tag <thead>?": "A tag <thead> agrupa o cabeçalho de uma tabela HTML, contendo as linhas de cabeçalho.",
    "O que é a tag <tbody>?": "A tag <tbody> agrupa o corpo de uma tabela HTML, contendo as linhas de dados.",
    "O que é a tag <tfoot>?": "A tag <tfoot> agrupa o rodapé de uma tabela HTML, geralmente usada para totais ou resumos.",
    "O que é a tag <iframe>?": "A tag <iframe> permite incorporar outro documento HTML dentro de um documento, como um vídeo ou uma página externa.",
    "O que é a tag <audio>?": "A tag <audio> é usada para incorporar conteúdo de áudio, como músicas ou efeitos sonoros, na página HTML.",
    "O que é a tag <video>?": "A tag <video> é usada para incluir conteúdo de vídeo na página HTML." 
}
